Revit 2024 API
ParameterTypeId.EnergyAnalysisBuildingOperatingSchedule Property
 "Building Operating Schedule"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId EnergyAnalysisBuildingOperatingSchedule { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisBuildingOperatingSchedule As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisBuildingOperatingSchedule {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace